In [7]:
import pandas as pd
file = 'Players.csv'
df = pd.read_csv(file)
df.head(3)

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN

In [6]:
df.columns

Index(['Unnamed: 0', 'Player', 'height', 'weight', 'collage', 'born',
       'birth_city', 'birth_state'],
      dtype='object')

In [21]:
df.loc[1:5,['Player','height','weight']]

          Player  height  weight
1   Cliff Barker   188.0    83.0
2  Leo Barnhorst   193.0    86.0
3     Ed Bartels   196.0    88.0
4    Ralph Beard   178.0    79.0
5     Gene Berce   180.0    79.0

In [ ]:
df.iloc[1:30:3,::]

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky
7,7,Nelson Bobb,183.0,77.0,Temple University,1924.0,Philadelphia,Pennsylvania
10,10,Don Boven,193.0,95.0,Western Michigan University,1925.0,Kalamazoo,Michigan
13,13,Bob Brannum,196.0,97.0,Michigan State University,1925.0,NaN,NaN
16,16,Price Brookfield,193.0,83.0,West Texas A&M University,1920.0,Floydada,Texas
19,19,Walt Budko,196.0,99.0,Columbia University,1925.0,Kearney,New Jersey
22,22,Bill Calhoun,190.0,81.0,City College of San Francisco,1927.0,San Francisco,California
25,25,Jake Carter,193.0,88.0,East Texas State University,1924.0,NaN,NaN
28,28,Leroy Chollet,188.0,86.0,Canisius College,1925.0,New Orleans,Louisiana